// 获取商品分类
function getShopType(obj,event) {
    var productType1 = new Array("图书、音像、电子书刊","手机","家用电器","数码","家居家装","电脑办公","厨具","个护化妆","服饰内衣","钟表","鞋靴","母婴","礼品箱包","食品饮料、保健食品","珠宝","汽车用品","运动健康","玩具乐器","彩票、旅行、充值、票务","生鲜","整车");
    var productType2 = [["电子书刊","音像","英文原版","文艺","少儿","人文社科","经管励志","生活","科技","教育","港台图书","其他"],["手机通讯","运营商","手机配件"],["大 家 电","厨卫大电","厨房小电","生活电器","个护健康","五金家装"],["摄影摄像","数码配件","智能设备","影音娱乐","电子教育","虚拟商品"],["家纺","灯具","生活日用","家装软饰","宠物生活"],["电脑整机","电脑配件","外设产品","游戏设备","网络产品","办公设备","文具/耗材","服务产品"],["烹饪锅具","刀剪菜板","厨房配件","水具酒具","餐具","酒店用品","茶具/咖啡具"],["清洁用品","面部护肤","身体护理","口腔护理","女性护理","洗发护发","香水彩妆"],["女装","男装","内衣","洗衣服务","服饰配件"],["钟表"],["流行男鞋","时尚女鞋"],["奶粉","营养辅食","尿裤湿巾","喂养用品","洗护用品","童车童床","寝居服饰","妈妈专区","童装童鞋","安全座椅"],["潮流女包","精品男包","功能箱包","礼品","奢侈品","婚庆"],["进口食品","地方特产","休闲食品","粮油调味","饮料冲调","食品礼券","茗茶"],["时尚饰品","黄金","K金饰品","金银投资","银饰","钻石","翡翠玉石","水晶玛瑙","彩宝","铂金","木手串/把件","珍珠"],["维修保养","车载电器","美容清洗","汽车装饰","安全自驾","汽车服务","赛事改装"],["运动鞋包","运动服饰","骑行运动","垂钓用品","游泳用品","户外鞋服","户外装备","健身训练","体育用品"],["适用年龄","遥控/电动","毛绒布艺","娃娃玩具","模型玩具","健身玩具","动漫玩具","益智玩具","积木拼插","DIY玩具","创意减压","乐器"],["彩票","机票","酒店","旅行","充值","游戏","票务"],["产地直供","水果","猪牛羊肉","海鲜水产","禽肉蛋品","冷冻食品","熟食腊味","饮品甜品","蔬菜"],["全新整车","二手车"]];
    var productType3 = [[[["电子书","165"],["网络原创","166"],["数字杂志","167"],["多媒体图书","168"]],[["音乐","169"],["影视","170"],["教育音像","171"]],[["少儿","172"],["商务投资","173"],["英语学习与考试","174"],["文学","175"],["传记","176"],["励志","177"]],[["小说","178"],["文学","179"],["青春文学","180"],["传记","181"],["艺术","182"]],[["少儿","183"],["0-2岁","184"],["3-6岁","185"],["7-10岁","186"],["11-14岁","187"]],[["历史","188"],["哲学","189"],["国学","190"],["政治/军事","191"],["法律","192"],["人文社科","193"],["心理学","194"],["文化","195"],["社会科学","196"]],[["经济","197"],["金融与投资","198"],["管理","199"],["励志与成功","200"]],[["生活","201"],["健身与保健","202"],["家庭与育儿","203"],["旅游","204"],["烹饪美食","205"]],[["工业技术","206"],["科普读物","207"],["建筑","208"],["医学","209"],["科学与自然","210"],["计算机与互联网","211"],["电子通信","212"]],[["中小学教辅","213"],["教育与考试","214"],["外语学习","215"],["大中专教材","216"],["字典词典","217"]],[["艺术/设计/收藏","218"],["经济管理","219"],["文化/学术","220"],["少儿","221"]],[["工具书","222"],["杂志/期刊","223"],["套装书","224"]]],[[["手机","225"],["对讲机","226"]],[["合约机","227"],["选号中心","228"],["装宽带","229"],["办套餐","230"]],[["移动电源","231"],["电池/移动电源","232"],["蓝牙耳机","233"],["充电器/数据线","234"],["苹果周边","235"],["手机耳机","236"],["手机贴膜","237"],["手机存储卡","238"],["充电器","239"],["数据线","240"],["手机保护套","241"],["车载配件","242"],["iPhone 配件","243"],["手机电池","244"],["创意配件","245"],["便携/无线音响","246"],["手机饰品","247"],["拍照配件","248"],["手机支架","249"]]],[[["平板电视","250"],["空调","251"],["冰箱","252"],["洗衣机","253"],["家庭影院","254"],["DVD/电视盒子","255"],["迷你音响","256"],["冷柜/冰吧","257"],["家电配件","258"],["功放","259"],["回音壁/Soundbar","260"],["Hi-Fi专区","261"],["电视盒子","262"],["酒柜","263"]],[["燃气灶","264"],["油烟机","265"],["热水器","266"],["消毒柜","267"],["洗碗机","268"]],[["料理机","269"],["榨汁机","270"],["电饭煲","271"],["电压力锅","272"],["豆浆机","273"],["咖啡机","274"],["微波炉","275"],["电烤箱","276"],["电磁炉","277"],["面包机","278"],["煮蛋器","279"],["酸奶机","280"],["电炖锅","281"],["电水壶/热水瓶","282"],["电饼铛","283"],["多用途锅","284"],["电烧烤炉","285"],["果蔬解毒机","286"],["其它厨房电器","287"],["养生壶/煎药壶","288"],["电热饭盒","289"]],[["取暖电器","290"],["净化器","291"],["加湿器","292"],["扫地机器人","293"],["吸尘器","294"],["挂烫机/熨斗","295"],["插座","296"],["电话机","297"],["清洁机","298"],["除湿机","299"],["干衣机","300"],["收录/音机","301"],["电风扇","302"],["冷风扇","303"],["其它生活电器","304"],["生活电器配件","305"],["净水器","306"],["饮水机","307"]],[["剃须刀","308"],["剃/脱毛器","309"],["口腔护理","310"],["电吹风","311"],["美容器","312"],["理发器","313"],["卷/直发器","314"],["按摩椅","315"],["按摩器","316"],["足浴盆","317"],["血压计","318"],["电子秤/厨房秤","319"],["血糖仪","320"],["体温计","321"],["其它健康电器","322"],["计步器/脂肪检测仪","323"]],[["电动工具","324"],["手动工具","325"],["仪器仪表","326"],["浴霸/排气扇","327"],["灯具","328"],["LED灯","329"],["洁身器","330"],["水槽","331"],["龙头","332"],["淋浴花洒","333"],["厨卫五金","334"],["家具五金","335"],["门铃","336"],["电气开关","337"],["插座","338"],["电工电料","339"],["监控安防","340"],["电线/线缆","341"]]],[[["数码相机","342"],["单电/微单相机","343"],["单反相机","344"],["摄像机","345"],["拍立得","346"],["运动相机","347"],["镜头","348"],["户外器材","349"],["影棚器材","350"],["冲印服务","351"],["数码相框","352"]],[["存储卡","353"],["读卡器","354"],["滤镜","355"],["闪光灯/手柄","356"],["相机包","357"],["三脚架/云台","358"],["相机清洁/贴膜","359"],["机身附件","360"],["镜头附件","361"],["电池/充电器","362"],["移动电源","363"],["数码支架","364"]],[["智能手环","365"],["智能手表","366"],["智能眼镜","367"],["运动跟踪器","368"],["健康监测","369"],["智能配饰","370"],["智能家居","371"],["体感车","372"],["其他配件","373"],["智能机器人","374"],["无人机","375"]],[["MP3/MP4","376"],["智能设备","377"],["耳机/耳麦","378"],["便携/无线音箱","379"],["音箱/音响","380"],["高清播放器","381"],["收音机","382"],["MP3/MP4配件","383"],["麦克风","384"],["专业音频","385"],["苹果配件","386"]],[["学生平板","387"],["点读机/笔","388"],["早教益智","389"],["录音笔","390"],["电纸书","391"],["电子词典","392"],["复读机","393"]],[["延保服务","394"],["杀毒软件","395"],["积分商品","396"]]],[[["桌布/罩件","397"],["地毯地垫","398"],["沙发垫套/椅垫","399"],["床品套件","400"],["被子","401"],["枕芯","402"],["床单被罩","403"],["毯子","404"],["床垫/床褥","405"],["蚊帐","406"],["抱枕靠垫","407"],["毛巾浴巾","408"],["电热毯","409"],["窗帘/窗纱","410"],["布艺软饰","411"],["凉席","412"]],[["台灯","413"],["节能灯","414"],["装饰灯","415"],["落地灯","416"],["应急灯/手电","417"],["LED灯","418"],["吸顶灯","419"],["五金电器","420"],["筒灯射灯","421"],["吊灯","422"],["氛围照明","423"]],[["保暖防护","424"],["收纳用品","425"],["雨伞雨具","426"],["浴室用品","427"],["缝纫/针织用品","428"],["洗晒/熨烫","429"],["净化除味","430"]],[["相框/照片墙","431"],["装饰字画","432"],["节庆饰品","433"],["手工/十字绣","434"],["装饰摆件","435"],["帘艺隔断","436"],["墙贴/装饰贴","437"],["钟饰","438"],["花瓶花艺","439"],["香薰蜡烛","440"],["创意家居","441"]],[["宠物主粮","442"],["宠物零食","443"],["医疗保健","444"],["家居日用","445"],["宠物玩具","446"],["出行装备","447"],["洗护美容","448"]]],[[["笔记本","449"],["超极本","450"],["游戏本","451"],["平板电脑","452"],["平板电脑配件","453"],["台式机","454"],["服务器/工作站","455"],["笔记本配件","456"],["一体机","457"]],[["CPU","458"],["主板","459"],["显卡","460"],["硬盘","461"],["SSD固态硬盘","462"],["内存","463"],["机箱","464"],["电源","465"],["显示器","466"],["刻录机/光驱","467"],["散热器","468"],["声卡/扩展卡","469"],["装机配件","470"],["组装电脑","471"]],[["移动硬盘","472"],["U盘","473"],["鼠标","474"],["键盘","475"],["鼠标垫","476"],["摄像头","477"],["手写板","478"],["硬盘盒","479"],["插座","480"],["线缆","481"],["UPS电源","482"],["电脑工具","483"],["游戏设备","484"],["电玩","485"],["电脑清洁","486"],["网络仪表仪器","487"]],[["游戏机","488"],["游戏耳机","489"],["手柄/方向盘","490"],["游戏软件","491"],["游戏周边","492"]],[["路由器","493"],["网卡","494"],["交换机","495"],["网络存储","496"],["4G/3G上网","497"],["网络盒子","498"],["网络配件","499"]],[["投影机","500"],["投影配件","501"],["多功能一体机","502"],["打印机","503"],["传真设备","504"],["验钞/点钞机","505"],["扫描设备","506"],["复合机","507"],["碎纸机","508"],["考勤机","509"],["收款/POS机","510"],["会议音频视频","511"],["保险柜","512"],["装订/封装机","513"],["安防监控","514"],["办公家具","515"],["白板","516"]],[["硒鼓/墨粉","517"],["墨盒","518"],["色带","519"],["纸类","520"],["办公文具","521"],["学生文具","522"],["财会用品","523"],["文件管理","524"],["本册/便签","525"],["计算器","526"],["笔类","527"],["画具画材","528"],["刻录碟片/附件","529"]],[["上门安装","530"],["延保服务","531"],["维修保养","532"],["电脑软件","533"],["京东服务","534"]]],[[["炒锅","535"],["煎锅","536"],["压力锅","537"],["蒸锅","538"],["汤锅","539"],["奶锅","540"],["锅具套装","541"],["煲类","542"],["水壶","543"],["火锅","544"]],[["菜刀","545"],["剪刀","546"],["刀具套装","547"],["砧板","548"],["瓜果刀/刨","549"],["多功能刀","550"]],[["保鲜盒","551"],["烘焙/烧烤","552"],["饭盒/提锅","553"],["储物/置物架","554"],["厨房DIY/小工具","555"]],[["塑料杯","556"],["运动水壶","557"],["玻璃杯","558"],["陶瓷/马克杯","559"],["保温杯","560"],["保温壶","561"],["酒杯/酒具","562"],["杯具套装","563"]],[["餐具套装","564"],["碗/碟/盘","565"],["筷勺/刀叉","566"],["一次性用品","567"],["果盘/果篮","568"]],[["自助餐炉","569"],["酒店餐具","570"],["酒店水具","571"]],[["整套茶具","572"],["茶杯","573"],["茶壶","574"],["茶盘茶托","575"],["茶叶罐","576"],["茶具配件","577"],["茶宠摆件","578"],["咖啡具","579"],["其他","580"]]],[[["纸品湿巾","581"],["衣物清洁","582"],["清洁工具","583"],["驱虫用品","584"],["家庭清洁","585"],["皮具护理","586"],["一次性用品","587"]],[["洁面","588"],["乳液面霜","589"],["面膜","590"],["剃须","591"],["套装","592"],["精华","593"],["眼霜","594"],["卸妆","595"],["防晒","596"],["防晒隔离","597"],["T区护理","598"],["眼部护理","599"],["精华露","600"],["爽肤水","601"]],[["沐浴","602"],["润肤","603"],["颈部","604"],["手足","605"],["纤体塑形","606"],["美胸","607"],["套装","608"],["精油","609"],["洗发护发","610"],["染发/造型","611"],["香薰精油","612"],["磨砂/浴盐","613"],["手工/香皂","614"],["洗发","615"],["护发","616"],["染发","617"],["磨砂膏","618"],["香皂","619"]],[["牙膏/牙粉","620"],["牙刷/牙线","621"],["漱口水","622"],["套装","623"]],[["卫生巾","624"],["卫生护垫","625"],["私密护理","626"],["脱毛膏","627"],["其他","628"]],[["洗发","629"],["护发","630"],["染发","631"],["造型","632"],["假发","633"],["套装","634"],["美发工具","635"],["脸部护理","636"]],[["香水","637"],["底妆","638"],["腮红","639"],["眼影","640"],["唇部","641"],["美甲","642"],["眼线","643"],["美妆工具","644"],["套装","645"],["防晒隔离","646"],["卸妆","647"],["眉笔","648"],["睫毛膏","649"]]],[[["T恤","650"],["衬衫","651"],["针织衫","652"],["雪纺衫","653"],["卫衣","654"],["马甲","655"],["连衣裙","656"],["半身裙","657"],["牛仔裤","658"],["休闲裤","659"],["打底裤","660"],["正装裤","661"],["小西装","662"],["短外套","663"],["风衣","664"],["毛呢大衣","665"],["真皮皮衣","666"],["棉服","667"],["羽绒服","668"],["大码女装","669"],["中老年女装","670"],["婚纱","671"],["打底衫","672"],["旗袍/唐装","673"],["加绒裤","674"],["吊带/背心","675"],["羊绒衫","676"],["短裤","677"],["皮草","678"],["礼服","679"],["仿皮皮衣","680"],["羊毛衫","681"],["设计师/潮牌","682"]],[["衬衫","683"],["T恤","684"],["POLO衫","685"],["针织衫","686"],["羊绒衫","687"],["卫衣","688"],["马甲/背心","689"],["夹克","690"],["风衣","691"],["毛呢大衣","692"],["仿皮皮衣","693"],["西服","694"],["棉服","695"],["羽绒服","696"],["牛仔裤","697"],["休闲裤","698"],["西裤","699"],["西服套装","700"],["大码男装","701"],["中老年男装","702"],["唐装/中山装","703"],["工装","704"],["真皮皮衣","705"],["加绒裤","706"],["卫裤/运动裤","707"],["短裤","708"],["设计师/潮牌","709"],["羊毛衫","710"]],[["文胸","711"],["女式内裤","712"],["男式内裤","713"],["睡衣/家居服","714"],["塑身美体","715"],["泳衣","716"],["吊带/背心","717"],["抹胸","718"],["连裤袜/丝袜","719"],["美腿袜","720"],["商务男袜","721"],["保暖内衣","722"],["情侣睡衣","723"],["文胸套装","724"],["少女文胸","725"],["休闲棉袜","726"],["大码内衣","727"],["内衣配件","728"],["打底裤袜","729"],["打底衫","730"],["秋衣秋裤","731"],["情趣内衣","732"]],[["服装洗护","733"]],[["太阳镜","734"],["光学镜架/镜片","735"],["围巾/手套/帽子套装","736"],["袖扣","737"],["棒球帽","738"],["毛线帽","739"],["遮阳帽","740"],["老花镜","741"],["装饰眼镜","742"],["防辐射眼镜","743"],["游泳镜","744"],["女士丝巾/围巾/披肩","745"],["男士丝巾/围巾","746"],["鸭舌帽","747"],["贝雷帽","748"],["礼帽","749"],["真皮手套","750"],["毛线手套","751"],["防晒手套","752"],["男士腰带/礼盒","753"],["女士腰带/礼盒","754"],["钥匙扣","755"],["遮阳伞/雨伞","756"],["口罩","757"],["耳罩/耳包","758"],["假领","759"],["毛线/布面料","760"],["领带/领结/领带夹","761"]]],[[["男表","762"],["瑞表","763"],["女表","764"],["国表","765"],["日韩表","766"],["欧美表","767"],["德表","768"],["儿童手表","769"],["智能手表","770"],["闹钟","771"],["座钟挂钟","772"],["钟表配件","773"]]],[[["商务休闲鞋","774"],["正装鞋","775"],["休闲鞋","776"],["凉鞋/沙滩鞋","777"],["男靴","778"],["功能鞋","779"],["拖鞋/人字拖","780"],["雨鞋/雨靴","781"],["传统布鞋","782"],["鞋配件","783"],["帆布鞋","784"],["增高鞋","785"],["工装鞋","786"],["定制鞋","787"]],[["高跟鞋","788"],["单鞋","789"],["休闲鞋","790"],["凉鞋","791"],["女靴","792"],["雪地靴","793"],["拖鞋/人字拖","794"],["踝靴","795"],["筒靴","796"],["帆布鞋","797"],["雨鞋/雨靴","798"],["妈妈鞋","799"],["鞋配件","800"],["特色鞋","801"],["鱼嘴鞋","802"],["布鞋/绣花鞋","803"],["马丁靴","804"],["坡跟鞋","805"],["松糕鞋","806"],["内增高","807"],["防水台","808"]]],[[["婴幼奶粉","809"],["孕妈奶粉","810"]],[["益生菌/初乳","811"],["米粉/菜粉","812"],["果泥/果汁","813"],["DHA","814"],["宝宝零食","815"],["钙铁锌/维生素","816"],["清火/开胃","817"],["面条/粥","818"]],[["婴儿尿裤","819"],["拉拉裤","820"],["婴儿湿巾","821"],["成人尿裤","822"]],[["奶瓶奶嘴","823"],["吸奶器","824"],["暖奶消毒","825"],["儿童餐具","826"],["水壶/水杯","827"],["牙胶安抚","828"],["围兜/防溅衣","829"],["辅食料理机","830"],["食物存储","831"]],[["宝宝护肤","832"],["洗发沐浴","833"],["奶瓶清洗","834"],["驱蚊防晒","835"],["理发器","836"],["洗澡用具","837"],["婴儿口腔清洁","838"],["洗衣液/皂","839"],["日常护理","840"],["座便器","841"]],[["婴儿推车","842"],["餐椅摇椅","843"],["婴儿床","844"],["学步车","845"],["三轮车","846"],["自行车","847"],["电动车","848"],["扭扭车","849"],["滑板车","850"],["婴儿床垫","851"]],[["婴儿外出服","852"],["婴儿内衣","853"],["婴儿礼盒","854"],["婴儿鞋帽袜","855"],["安全防护","856"],["家居床品","857"],["睡袋/抱被","858"],["爬行垫","859"]],[["妈咪包/背婴带","860"],["产后塑身","861"],["文胸/内裤","862"],["防辐射服","863"],["孕妈装","864"],["孕期营养","865"],["孕妇护肤","866"],["待产护理","867"],["月子装","868"],["防溢乳垫","869"]],[["套装","870"],["上衣","871"],["裤子","872"],["裙子","873"],["内衣/家居服","874"],["羽绒服/棉服","875"],["亲子装","876"],["儿童配饰","877"],["礼服/演出服","878"],["运动鞋","879"],["皮鞋/帆布鞋","880"],["靴子","881"],["凉鞋","882"],["功能鞋","883"],["户外/运动服","884"]],[["提篮式","885"],["安全座椅","886"],["增高垫","887"]]],[[["钱包","888"],["手拿包","889"],["单肩包","890"],["双肩包","891"],["手提包","892"],["斜挎包","893"],["钥匙包","894"],["卡包/零钱包","895"]],[["男士钱包","896"],["男士手包","897"],["卡包名片夹","898"],["商务公文包","899"],["双肩包","900"],["单肩/斜挎包","901"],["钥匙包","902"]],[["电脑包","903"],["拉杆箱","904"],["旅行包","905"],["旅行配件","906"],["休闲运动包","907"],["拉杆包","908"],["登山包","909"],["妈咪包","910"],["书包","911"],["相机包","912"],["腰包/胸包","913"]],[["火机烟具","914"],["礼品文具","915"],["军刀军具","916"],["收藏品","917"],["工艺礼品","918"],["创意礼品","919"],["礼盒礼券","920"],["鲜花绿植","921"],["婚庆节庆","922"],["京东卡","923"],["美妆礼品","924"],["礼品定制","925"],["京东福卡","926"],["古董文玩","927"]],[["箱包","928"],["钱包","929"],["服饰","930"],["腰带","931"],["太阳镜/眼镜框","932"],["配件","933"],["鞋靴","934"],["饰品","935"],["名品腕表","936"],["高档化妆品","937"]],[["婚嫁首饰","938"],["婚纱摄影","939"],["婚纱礼服","940"],["婚庆服务","941"],["婚庆礼品/用品","942"],["婚宴","943"]]],[[["饼干蛋糕","944"],["糖果/巧克力","945"],["休闲零食","946"],["冲调饮品","947"],["粮油调味","948"],["牛奶","949"]],[["其他特产","950"],["新疆","951"],["北京","952"],["山西","953"],["内蒙古","954"],["福建","955"],["湖南","956"],["四川","957"],["云南","958"],["东北","959"]],[["休闲零食","960"],["坚果炒货","961"],["肉干肉脯","962"],["蜜饯果干","963"],["糖果/巧克力","964"],["饼干蛋糕","965"],["无糖食品","966"]],[["米面杂粮","967"],["食用油","968"],["调味品","969"],["南北干货","970"],["方便食品","971"],["有机食品","972"]],[["饮用水","973"],["饮料","974"],["牛奶乳品","975"],["咖啡/奶茶","976"],["冲饮谷物","977"],["蜂蜜/柚子茶","978"],["成人奶粉","979"]],[["月饼","980"],["大闸蟹","981"],["粽子","982"],["卡券","983"]],[["铁观音","984"],["普洱","985"],["龙井","986"],["绿茶","987"],["红茶","988"],["乌龙茶","989"],["花草茶","990"],["花果茶","991"],["养生茶","992"],["黑茶","993"],["白茶","994"],["其它茶","995"]]],[[["项链","996"],["手链/脚链","997"],["戒指","998"],["耳饰","999"],["毛衣链","1000"],["发饰/发卡","1001"],["胸针","1002"],["饰品配件","1003"],["婚庆饰品","1004"]],[["黄金吊坠","1005"],["黄金项链","1006"],["黄金转运珠","1007"],["黄金手镯/手链/脚链","1008"],["黄金耳饰","1009"],["黄金戒指","1010"]],[["K金吊坠","1011"],["K金项链","1012"],["K金手镯/手链/脚链","1013"],["K金戒指","1014"],["K金耳饰","1015"]],[["投资金","1016"],["投资银","1017"],["投资收藏","1018"]],[["银吊坠/项链","1019"],["银手镯/手链/脚链","1020"],["银戒指","1021"],["银耳饰","1022"],["足银手镯","1023"],["宝宝银饰","1024"]],[["裸钻","1025"],["钻戒","1026"],["钻石项链/吊坠","1027"],["钻石耳饰","1028"],["钻石手镯/手链","1029"]],[["项链/吊坠","1030"],["手镯/手串","1031"],["戒指","1032"],["耳饰","1033"],["挂件/摆件/把件","1034"],["玉石孤品","1035"]],[["项链/吊坠","1036"],["耳饰","1037"],["手镯/手链/脚链","1038"],["戒指","1039"],["头饰/胸针","1040"],["摆件/挂件","1041"]],[["琥珀/蜜蜡","1042"],["碧玺","1043"],["红宝石/蓝宝石","1044"],["坦桑石","1045"],["珊瑚","1046"],["祖母绿","1047"],["葡萄石","1048"],["其他天然宝石","1049"],["项链/吊坠","1050"],["耳饰","1051"],["手镯/手链","1052"],["戒指","1053"]],[["铂金项链/吊坠","1054"],["铂金手镯/手链/脚链","1055"],["铂金戒指","1056"],["铂金耳饰","1057"]],[["小叶紫檀","1058"],["黄花梨","1059"],["沉香木","1060"],["金丝楠","1061"],["菩提","1062"],["其他","1063"],["橄榄核/核桃","1064"],["檀香","1065"]],[["珍珠项链","1066"],["珍珠吊坠","1067"],["珍珠耳饰","1068"],["珍珠手链","1069"],["珍珠戒指","1070"],["珍珠胸针","1071"]]],[[["机油","1072"],["正时皮带","1073"],["添加剂","1074"],["汽车喇叭","1075"],["防冻液","1076"],["汽车玻璃","1077"],["滤清器","1078"],["火花塞","1079"],["减震器","1080"],["柴机油/辅助油","1081"],["雨刷","1082"],["车灯","1083"],["后视镜","1084"],["轮胎","1085"],["轮毂","1086"],["刹车片/盘","1087"],["维修配件","1088"],["蓄电池","1089"],["底盘装甲/护板","1090"],["贴膜","1091"],["汽修工具","1092"],["改装配件","1093"]],[["导航仪","1094"],["安全预警仪","1095"],["行车记录仪","1096"],["倒车雷达","1097"],["蓝牙设备","1098"],["车载影音","1099"],["净化器","1100"],["电源","1101"],["智能驾驶","1102"],["车载电台","1103"],["车载电器配件","1104"],["吸尘器","1105"],["智能车机","1106"],["冰箱","1107"],["汽车音响","1108"],["车载生活电器","1109"]],[["车蜡","1110"],["补漆笔","1111"],["玻璃水","1112"],["清洁剂","1113"],["洗车工具","1114"],["镀晶镀膜","1115"],["打蜡机","1116"],["洗车配件","1117"],["洗车机","1118"],["洗车水枪","1119"],["毛巾掸子","1120"]],[["脚垫","1121"],["座垫","1122"],["座套","1123"],["后备箱垫","1124"],["头枕腰靠","1125"],["方向盘套","1126"],["香水","1127"],["空气净化","1128"],["挂件摆件","1129"],["功能小件","1130"],["车身装饰件","1131"],["车衣","1132"]],[["安全座椅","1133"],["胎压监测","1134"],["防盗设备","1135"],["应急救援","1136"],["保温箱","1137"],["地锁","1138"],["摩托车","1139"],["充气泵","1140"],["储物箱","1141"],["自驾野营","1142"],["摩托车装备","1143"]],[["清洗美容","1144"],["功能升级","1145"],["保养维修","1146"],["油卡充值","1147"],["车险","1148"],["加油卡","1149"],["ETC","1150"],["驾驶培训","1151"]],[["赛事服装","1152"],["赛事用品","1153"],["制动系统","1154"],["悬挂系统","1155"],["进气系统","1156"],["排气系统","1157"],["电子管理","1158"],["车身强化","1159"],["赛事座椅","1160"]]],[[["跑步鞋","1161"],["休闲鞋","1162"],["篮球鞋","1163"],["板鞋","1164"],["帆布鞋","1165"],["足球鞋","1166"],["乒羽网鞋","1167"],["专项运动鞋","1168"],["训练鞋","1169"],["拖鞋","1170"],["运动包","1171"]],[["羽绒服","1172"],["棉服","1173"],["运动裤","1174"],["夹克/风衣","1175"],["卫衣/套头衫","1176"],["T恤","1177"],["套装","1178"],["乒羽网服","1179"],["健身服","1180"],["运动背心","1181"],["毛衫/线衫","1182"],["运动配饰","1183"]],[["折叠车","1184"],["山地车/公路车","1185"],["电动车","1186"],["其他整车","1187"],["骑行服","1188"],["骑行装备","1189"],["平衡车","1190"]],[["鱼竿鱼线","1191"],["浮漂鱼饵","1192"],["钓鱼桌椅","1193"],["钓鱼配件","1194"],["钓箱鱼包","1195"],["其它","1196"]],[["泳镜","1197"],["泳帽","1198"],["游泳包防水包","1199"],["女士泳衣","1200"],["男士泳衣","1201"],["比基尼","1202"],["其它","1203"]],[["冲锋衣裤","1204"],["速干衣裤","1205"],["滑雪服","1206"],["羽绒服/棉服","1207"],["休闲衣裤","1208"],["抓绒衣裤","1209"],["软壳衣裤","1210"],["T恤","1211"],["户外风衣","1212"],["功能内衣","1213"],["军迷服饰","1214"],["登山鞋","1215"],["雪地靴","1216"],["徒步鞋","1217"],["越野跑鞋","1218"],["休闲鞋","1219"],["工装鞋","1220"],["溯溪鞋","1221"],["沙滩/凉拖","1222"],["户外袜","1223"]],[["帐篷/垫子","1224"],["睡袋/吊床","1225"],["登山攀岩","1226"],["户外配饰","1227"],["背包","1228"],["户外照明","1229"],["户外仪表","1230"],["户外工具","1231"],["望远镜","1232"],["旅游用品","1233"],["便携桌椅床","1234"],["野餐烧烤","1235"],["军迷用品","1236"],["救援装备","1237"],["滑雪装备","1238"],["极限户外","1239"],["冲浪潜水","1240"]],[["综合训练器","1241"],["其他大型器械","1242"],["哑铃","1243"],["仰卧板/收腹机","1244"],["其他中小型器材","1245"],["瑜伽舞蹈","1246"],["甩脂机","1247"],["踏步机","1248"],["武术搏击","1249"],["健身车/动感单车","1250"],["跑步机","1251"],["运动护具","1252"]],[["羽毛球","1253"],["乒乓球","1254"],["篮球","1255"],["足球","1256"],["网球","1257"],["排球","1258"],["高尔夫","1259"],["台球","1260"],["棋牌麻将","1261"],["轮滑滑板","1262"],["其他","1263"]]],[[["0-6个月","1264"],["6-12个月","1265"],["1-3岁","1266"],["3-6岁","1267"],["6-14岁","1268"],["14岁以上","1269"]],[["遥控车","1270"],["遥控飞机","1271"],["遥控船","1272"],["机器人","1273"],["轨道/助力","1274"]],[["毛绒/布艺","1275"],["靠垫/抱枕","1276"]],[["芭比娃娃","1277"],["卡通娃娃","1278"],["智能娃娃","1279"]],[["仿真模型","1280"],["拼插模型","1281"],["收藏爱好","1282"]],[["炫舞毯","1283"],["爬行垫/毯","1284"],["户外玩具","1285"],["戏水玩具","1286"]],[["电影周边","1287"],["卡通周边","1288"],["网游周边","1289"]],[["摇铃/床铃","1290"],["健身架","1291"],["早教启智","1292"],["拖拉玩具","1293"]],[["积木","1294"],["拼图","1295"],["磁力棒","1296"],["立体拼插","1297"]],[["手工彩泥","1298"],["绘画工具","1299"],["情景玩具","1300"]],[["减压玩具","1301"],["创意玩具","1302"]],[["钢琴","1303"],["电子琴/电钢琴","1304"],["吉他/尤克里里","1305"],["打击乐器","1306"],["西洋管弦","1307"],["民族管弦乐器","1308"],["乐器配件","1309"],["电脑音乐","1310"],["工艺礼品乐器","1311"],["口琴/口风琴/竖笛","1312"],["手风琴","1313"]]],[[["双色球","1314"],["大乐透","1315"],["福彩3D","1316"],["排列三","1317"],["排列五","1318"],["七星彩","1319"],["七乐彩","1320"],["竞彩足球","1321"],["竞彩篮球","1322"],["新时时彩","1323"]],[["国内机票","1324"]],[["国内酒店","1325"],["酒店团购","1326"]],[["度假","1327"],["景点","1328"],["租车","1329"],["火车票","1330"],["旅游团购","1331"]],[["手机充值","1332"]],[["游戏点卡","1333"],["QQ充值","1334"]],[["电影票","1335"],["演唱会","1336"],["话剧歌剧","1337"],["音乐会","1338"],["体育赛事","1339"],["舞蹈芭蕾","1340"],["戏曲综艺","1341"]]],[[["东北","1342"],["华北","1343"],["西北","1344"],["华中","1345"],["华东","1346"],["华南","1347"],["西南","1348"]],[["苹果","1349"],["橙子","1350"],["奇异果/猕猴桃","1351"],["车厘子/樱桃","1352"],["芒果","1353"],["蓝莓","1354"],["火龙果","1355"],["葡萄/提子","1356"],["柚子","1357"],["香蕉","1358"],["牛油果","1359"],["梨","1360"],["菠萝/凤梨","1361"],["桔/橘","1362"],["柠檬","1363"],["草莓","1364"],["桃/李/杏","1365"],["更多水果","1366"],["水果礼盒/券","1367"]],[["牛肉","1368"],["羊肉","1369"],["猪肉","1370"],["内脏类","1371"]],[["鱼类","1372"],["虾类","1373"],["蟹类","1374"],["贝类","1375"],["海参","1376"],["海产干货","1377"],["其他水产","1378"],["海产礼盒","1379"]],[["鸡肉","1380"],["鸭肉","1381"],["蛋类","1382"],["其他禽类","1383"]],[["水饺/馄饨","1384"],["汤圆/元宵","1385"],["面点","1386"],["火锅丸串","1387"],["速冻半成品","1388"],["奶酪黄油","1389"]],[["熟食","1390"],["腊肠/腊肉","1391"],["火腿","1392"],["糕点","1393"],["礼品卡券","1394"]],[["冷藏果蔬汁","1395"],["冰激凌","1396"],["其他","1397"]],[["叶菜类","1398"],["茄果瓜类","1399"],["根茎类","1400"],["鲜菌菇","1401"],["葱姜蒜椒","1402"],["半加工蔬菜","1403"]]],[[["微型车","1404"],["小型车","1405"],["紧凑型车","1406"],["中型车","1407"],["中大型车","1408"],["豪华车","1409"],["MPV","1410"],["SUV","1411"],["跑车","1412"]],[["微型车（二手）","1413"],["小型车（二手）","1414"],["紧凑型车（二手）","1415"],["中型车（二手）","1416"],["中大型车（二手）","1417"],["豪华车（二手）","1418"],["MPV（二手）","1419"],["SUV（二手）","1420"],["跑车（二手）","1421"],["皮卡（二手）","1422"],["面包车（二手）","1423"]]]];
    var productId = {};
    var $byLcyShopType = $("#byLcyShopType");
    var $byLcyShopTypeParentDiv = $(obj).parent("div");
    var height = 0;
    var width = 0;

    // 遍历添加商品分类选项
    if ($byLcyShopType.size() < 1) {
        $byLcyShopTypeParentDiv.append("<div id='byLcyShopType'></div>");
        height = $byLcyShopTypeParentDiv.height();
        width = $byLcyShopTypeParentDiv.width();
        $byLcyShopType = $("#byLcyShopType");
        $byLcyShopType.css("cssText","top: "+(height-1)+"px; width: "+(width-2)+"px;");
        for(var i=0; i<productType1.length; i++){
            $byLcyShopType.append("<div class='shopTypez1'><span>"+productType1[i]+"</span><i style='float: right; padding-right: 10px;'>&gt</i></div>");
            for(var j=0; j<productType2[i].length; j++){
                $byLcyShopType.find('.shopTypez1').eq(i).append("<div class='shopTypez2' style='  left:"+(width-12)+"px; width:"+width+"px; '>"+productType2[i][j]+"</div>");
                for(var m=0; m<productType3[i][j].length; m++){
                    $byLcyShopType.find('.shopTypez1').eq(i).find('.shopTypez2').eq(j).append("<div class='shopTypez3' data-id='"+productType3[i][j][m][1]+"' style='  left:"+(width)+"px; width:"+width+"px; '>"+productType3[i][j][m][0]+"</div>");
                }
            }
        }
    }

    // 点击商品分类获取商品分类编号
    $('#byLcyShopType .shopTypez3').click(function (event) {
        $("#shopType").val($(this).attr("data-id"));
        $("#validateShopType").text("选中类型："+$(this).text());
        $("#validateShopType").css("cssText","color:#b2b2b2 !important");
        $('body').trigger('click');
        event.stopPropagation();
    });

    // 直接输入商品分类编号
    $('#shopType').change(function () {
        $('#shopType').blur(function () {
            if($(this).val() == "" || $(this).val() == null || $(this).val() == undefined){
                $("#validateShopType").text("请输入商品编号");
                $("#validateShopType").css("cssText","color:red !important");
            }else{
                var productTypeStr = "";
                for(var i=0; i<productType1.length; i++){
                    for(var j=0; j<productType2[i].length; j++){
                        for(var m=0; m<productType3[i][j].length; m++){
                            if($(this).val() ==  parseInt(productType3[i][j][m][1])){
                                productTypeStr = productType3[i][j][m][0];
                                break;
                            }
                        }
                    }
                }
                if(productTypeStr == "" || productTypeStr == null || productTypeStr == undefined){
                    $("#validateShopType").text("商品编号错误");
                    $("#validateShopType").css("cssText","color:red !important");
                }else{
                    $("#validateShopType").text("选中类型："+productTypeStr);
                    $("#validateShopType").css("cssText","color:#b2b2b2 !important");
                }
            }
            event.stopPropagation();
        });
    });

    // $byLcyShopType.children("div").click(function (event) {
    //     event.stopPropagation();
    // });

    bodyClickRemoveDivById($byLcyShopType);
    event.stopPropagation();
}

// 商品属性
function productProperty() {
    var maxBl = -1;
    var max;
    $('.addPropertyValue').click(function (event) {
        max = $(this).parents("dl").find("dd").size();
        var thisIndex = $('#sku dl').index($(this).parents('dl'));
        if(max >= 9 && (maxBl!=(-1))){
            if(thisIndex!=maxBl){
                alert("只有一个属性可以达到10个值");
                return false;
            }
            $(this).parents('dl').find('.convertPropertyOfImg').click(function (event) {
                maxBl = (-1);
                event.stopPropagation();
            });
            $(this).parents('dl').find('.convertPropertyOfText').click(function (event) {
                event.stopPropagation();
                maxBl = (-1);
            });
        }
        if(max>=30){
            alert("最多只能添加30个属性值");
        }else{
            var propertyValueHtml;
            if($(this).parents("dl").attr("class") == "img-dl"){
                // propertyValueHtml = "<dd><input class=\"imgProperty\" type=\"file\" multiple value=\"\"/><div class=\"fa fa-plus addFile\"></div></dd>";
            }else{
                propertyValueHtml = "<dd><input placeholder=\"销售属性值\" value=\"\"></dd>";
                $(this).parents("dl").append(propertyValueHtml);
                addImgDiv($(this).parents("dl").find('.addFile'), $(this).parents("dl").find('.imgProperty'));
            }
        }
        max = $(this).parents("dl").find("dd").size();
        if(max >= 10){
            maxBl = $('#sku dl').index($(this).parents('dl'));
        }
    });


    $('.removePropertyValue').click(function (event) {
        max = $(this).parents("dl").find("dd").size();
        if(max == 1){
            alert("至少要有一个属性值");
        }else{
            $(this).parents("dl").find("dd").eq(max-1).remove();
        }
        event.stopPropagation();
    });

    // 转换成图片属性
    $('.convertPropertyOfImg').click(function (event) {
        event.stopPropagation();
        var imgPropertyNum = $(this).parents("dl").index();
        if(imgPropertyNum != 0){
            imgPropertyNum /= 2;
        }
        imgPropertyNum++;
        $(this).find('span').removeClass("fa-image").addClass("fa-trash");
        var propertyValueHtml = "<dd><input class=\"imgProperty\" type=\"file\" name='imgProperty"+imgPropertyNum+"' multiple='multiple' value=\"\"/><div title='点击添加图片' alt='点击添加图片' class=\"fa fa-plus addFile\"></div></dd>";
        $(this).parents("dl").find("dd").remove();
        $(this).parents("dl").addClass('img-dl');
        $(this).parents("dl").append(propertyValueHtml);
        $(this).parents("dl").find(".addPropertyValue").css("cssText","visibility: hidden;");
        $(this).parents("dl").find(".removePropertyValue").css("cssText","visibility: hidden;");

        addImgDiv($(this).parents("dl").find('.addFile'), $(this).parents("dl").find('.imgProperty'));
    });

    // 转换成文字属性
    $(".convertPropertyOfText").click(function (event) {
        $(this).parents("dl").find('.convertPropertyOfImg').trigger("click");
        $('.convertPropertyOfImg').find('span').removeClass("fa-trash").addClass("fa-image");
        var propertyValueHtml = "<dd><input placeholder=\"销售属性值\" value=\"\"></dd>";
            $(this).parents("dl").find("dd").remove();
        $(this).parents("dl").removeClass('img-dl');
        for(var i=0; i<5; i++){
            $(this).parents("dl").append(propertyValueHtml);
        }
        $(this).parents("dl").find(".addPropertyValue").css("cssText","visibility: visible;");
        $(this).parents("dl").find(".removePropertyValue").css("cssText","visibility: visible;");
        event.stopPropagation();
    });

    function addImgDiv($addFile, $imgProperty) {
        // 点击添加图片
        $addFile.click(function (event) {
            if($(this).parents('dl').find('dd').size() > 1){
                return false;
            }
            $imgInput = $(this).siblings("input[type='file']");
            $imgInput.trigger("click");
            event.stopPropagation();
        });

        // 显示图片
        $imgProperty.change(function () {
            var _URL = window.URL || window.webkitURL;
            var file, img;
            var img = new Array();
            for (var i = 0; i < this.files.length; i++) {
                img[i] = new Image();
                // 获取图片宽高
                // img.onload = function () {
                //     alert(this.width + " " + this.height);
                // };
                img[i].src = _URL.createObjectURL(this.files[i]);
            }
            var $addFileBtn;
            $addFileBtn = $(this).parents('dl');
            if (img.length <= 30){
                var thisIndex = $('#sku dl').index($(this).parents('dl'));
                if(img.length >= 10 && maxBl == (-1)){
                    maxBl = thisIndex;
                    $(this).parents('dl').find('.convertPropertyOfImg').click(function (event) {
                        maxBl = (-1);
                        event.stopPropagation();
                    });
                    $(this).parents('dl').find('.convertPropertyOfText').click(function (event) {
                        maxBl = (-1);
                        event.stopPropagation();
                    });
                }else if(img.length >= 10){
                    $addFileBtn.find('.convertPropertyOfImg').trigger("click");
                    alert("只有一个属性可以达到10个值");
                    return false;
                }
                $addFileBtn.find('.addFile').removeClass("fa fa-plus");
                $addFileBtn.find('.addFile').eq(0).css("cssText", "background:url(" + img[0].src + ") center no-repeat;");

                // 添加缩略图
                var propertyValueHtml = "<dd><div class=\"fa fa-plus addFile\"></div></dd>";
                for(var i=1; i<img.length; i++){
                    $addFileBtn.append(propertyValueHtml);
                    $addFileBtn.find('.addFile').removeClass("fa fa-plus");
                    $addFileBtn.find('.addFile').eq(i).css("cssText", "background:url(" + img[i].src + ") center no-repeat;");
                }
            }else{
                $addFileBtn.find('.convertPropertyOfImg').trigger("click");
                alert("最多只能选30张图片");
            }
            // var url = "http://localhost:8080/xxmall/backstage/adminManage/testFile";
            // ajaxBaseOfValidateTable("{'header:'"+file+"}", url,$validata);
        });
    }

}

/**
 * 生成商品详细表
 * @param trNum 生成的行数
 * @param tdNum 生成的列数，目前只能为6
 */
function addProductInofTable(trNum, tdNum) {
    var html = "<tr>";
    var html2 = "<td><input type=\"text\" value=\"\"/></td>";
    var html3 = "<td></td>";
    var tr = "<tr>";
    var trEnd = "</tr>";

    if(trNum == 0){
        html = "";
    }
    for(var i=0; i<trNum; i++){
        for(var j=0; j<tdNum; j++){
            // 倒数第二一列
            if(j<4){
                html += html3;
            }else{
                html += html2;
            }
            // 最后一列
            if(j == 5){
                if(i==(trNum-1)){
                    html = html+trEnd;
                }else{
                    html = html+trEnd+tr;
                }
            }
        }
    }
    $('#productPropertyTable').find('tbody').append(html);

    // 商品规划详细值
    productInof();

    // 填写商品详细表
    fillTable(getInputTexts());

}

// 商品规划详细值
function productInof() {
    // $('#sku dt input').keydown(function(event){
    //     //event.which +
    //     var text = $(this).val();
    //     var thisNum = $('#sku dt input').index($(this));
    //     if(thisNum < 4){
    //         $('#productPropertyTable-title span').eq(thisNum).text(text);
    //     }
    // });
    // $('#sku dt input').keyup(function(){
    //     var text = $(this).val();
    //     var thisNum = $('#sku dt input').index($(this));
    //     if(thisNum== -1 || thisNum >4){
    //         return false;
    //     }
    //     if(thisNum <= 4){
    //         $('#productPropertyTable-title span').eq(thisNum).text(text);
    //     }
    // });

    for(var i=1; i<$('#productPropertyTable tr').size(); i++){
        $('#productPropertyTable tr').eq(i).find('td').eq(4).find('input').addClass('productPropertyTable-stock');
        $('#productPropertyTable tr').eq(i).find('td').eq(5).find('input').addClass('productPropertyTable-price');
    }

    var ppt_bl = false;
    // 批量填写表单
    // 价格
    var ppt_price = $('.productPropertyTable-price');
    var thisPriceNum1 = null;
    var thisPriceNum2 = null;
    ppt_price.keydown(function (event) {
        if(event.which == 16){
            ppt_bl = true;
        }
        event.stopPropagation();
        return true;
    });
    ppt_price.keyup(function (event) {
        event.stopPropagation();
        if(event.which == 16){
            ppt_bl = false;
        }
        if((event.which >=48 && event.which<=57) || event.which == 8 || event.which == 190){
            var str;
            str = $(this).val().split("。");
            if(str[1] != undefined){
                $(this).val(parseFloat($(this).val()));
            }
            str = $(this).val().split(".");
            if(str[0].length <= 7){
                if(str[0].substr(0,1)==0){
                    $(this).val($(this).val().substr(0,($(this).val().length-1)));
                    ppt_price.filter(".bF60").val($(this).val().substr(0,$(this).val().length));
                }
                ppt_price.filter(".bF60").val($(this).val());
            }else{
                $(this).val($(this).val().substr(0,($(this).val().length-1)));
                ppt_price.filter(".bF60").val($(this).val().substr(0,$(this).val().length));
            }

            if(str[1] != undefined && str[1].length > 2){
                $(this).val($(this).val().substr(0,($(this).val().length-1)));
                ppt_price.filter(".bF60").val($(this).val().substr(0,$(this).val().length));
            }else{
                ppt_price.filter(".bF60").val($(this).val());
            }
        }else{
            var str = parseFloat($(this).val());
            if(isNaN(str)){
                $(this).val('');
            }else{
                $(this).val(str);
            }
        }
        return true;
    });
    // 按下鼠标
    ppt_price.click(function(event){
        thisStockNum1 = null;
        thisStockNum2 = null;
        if(thisPriceNum1 == null){
            thisPriceNum1 = ppt_price.index($(this));
        }else if(thisPriceNum2 == null){
            thisPriceNum2 = ppt_price.index($(this));
        }else{
            thisPriceNum2 = null;
            thisPriceNum1 = ppt_price.index($(this));
        }
        if(ppt_bl){
            ppt_bl = false;
            if(thisPriceNum1 > thisPriceNum2){
                for(var i=thisPriceNum2; i<=thisPriceNum1; i++){
                    ppt_price.eq(i).addClass('bF60');
                }
            }
            for(var i=thisPriceNum1; i<=thisPriceNum2; i++){
                ppt_price.eq(i).addClass('bF60');
            }
        }
        event.stopPropagation();
        return true;
    });

    // 表单离开焦点后
    ppt_price.blur(function () {
        $('#price-eraser').trigger('click');
        thisPriceNum1 = ppt_price.index($(this));
    });

    // 清除选中对象
    $('#price-eraser').click(function () {
        ppt_price.removeClass('bF60');
        thisPriceNum1 = null;
        thisPriceNum2 = null;
    });

    // 存货
    var ppt_stock = $('.productPropertyTable-stock');
    var thisStockNum1 = null;
    var thisStockNum2 = null;
    ppt_stock.keydown(function (event) {
        if(event.which == 16){
            ppt_bl = true;
        }
        event.stopPropagation();
        return true;
    });
    ppt_stock.keyup(function (event) {
        event.stopPropagation();
        if(event.which == 16){
            ppt_bl = false;
        }
        if(event.which >=48 && event.which<=57 || event.which == 8){
            var val = $(this).val();
            if(val.length >=2 && val.substr(0,1)==0){
                $(this).val($(this).val().substr(0,($(this).val().length-1)));
                ppt_price.filter(".bF60").val($(this).val().substr(0,$(this).val().length));
            }
            if(val < 0 || val >= 1000000){
                $(this).val($(this).val().substr(0,($(this).val().length-1)));
                ppt_price.filter(".bF60").val($(this).val().substr(0,$(this).val().length));
            }else{
                ppt_stock.filter(".bF60").val(val);
            }
        }else{
            var str = parseFloat($(this).val());
            if(isNaN(str)){
                $(this).val('');
            }else{
                $(this).val(str);
            }
        }
        return true;
    });
    // 按下鼠标
    ppt_stock.click(function(event){
        thisPriceNum1 = null;
        thisPriceNum2 = null;
        if(thisStockNum1 == null){
            thisStockNum1 = ppt_stock.index($(this));
        }else if(thisStockNum2 == null){
            thisStockNum2 = ppt_stock.index($(this));
        }else{
            thisStockNum2 = null;
            thisStockNum1 = ppt_stock.index($(this));
        }
        if(ppt_bl){
            ppt_bl = false;
            if(thisStockNum1 > thisStockNum2){
                for(var i=thisStockNum2; i<=thisStockNum1; i++){
                    ppt_stock.eq(i).addClass('bF60');
                }
            }
            for(var i=thisStockNum1; i<=thisStockNum2; i++){
                ppt_stock.eq(i).addClass('bF60');
            }
        }
        event.stopPropagation();
        return true;
    });

    // 表单离开焦点后
    ppt_stock.blur(function () {
        $('#stock-eraser').trigger('click');
        thisStockNum1 = ppt_stock.index($(this));
    });

    // 清除选中对象
    $('#stock-eraser').click(function (event) {
        ppt_stock.removeClass('bF60');
        thisStockNum1 = null;
        thisStockNum2 = null;
        event.stopPropagation();
        return false;
    });
}

// 计算商品详细表需要到的行数
function getProductInofTrCount() {
    var $sku = $('#sku ');
    var $dl = $sku.find('dl');
    var dlNum = $sku.find('dl').size();     // dl的总行数
    var notNullDdNum = new Array();       // 不为空值的dd行数（属性key值）
    var productInofTrCount = 1;         // 商品详细表所需要的行数
    var message = "";
    for(var i=0,ii=(-1); i<dlNum; i++){
        var dtVal = $dl.eq(i).find('dt').find('input').val();
        if(dtVal != "" && dtVal != null && dtVal != undefined){
            ii++;
            notNullDdNum[ii] = 0;
            var ddNum = $sku.find('dd').size();
            for(var j=0; j<ddNum; j++){
                var ddVal = "";
                if($dl.eq(i).hasClass('img-dl')){
                    ddVal = $dl.eq(i).find('dd').eq(j).find('div').attr('style');
                }else{
                    ddVal = $dl.eq(i).find('dd').eq(j).find('input').val();
                }
                if(ddVal != "" && ddVal != null && ddVal != undefined){
                    notNullDdNum[ii]++;
                }
            }
        }
    }
    for(var i=0; i<notNullDdNum.length; i++){
        if(notNullDdNum[i] != 0){
            productInofTrCount *= notNullDdNum[i];
            if(i == notNullDdNum.length-1){
                message += notNullDdNum[i] + "=";
            }else{
                message += notNullDdNum[i] + "*";
            }
        }
    }
    if(productInofTrCount > 750){
        alert('属性值过多，每个属性栏目内的属性值数量相乘不得超过750.现在为：'+message+productInofTrCount);
        return 0;
    }
    return productInofTrCount;
}

var skuInofJsonOfAjax = [{},{},{},{}];
// 获取填写在input的所有值
function getInputTexts() {
    var $sku_dl = $('#sku dl');
    var dtVal = '';// 单个的属性值
    var ddVal = '';// 单个的属性值
    var skuInofJson = [{},{},{},{}];
    for(var i=0,ii=0; i<$sku_dl.size(); i++){
        dtVal = $sku_dl.eq(i).find('dt').find('input').val();
        if(dtVal!=null && dtVal!=undefined && dtVal!=""){
            skuInofJson[ii][0] = dtVal;
            skuInofJsonOfAjax[ii][0] = dtVal;
        }else{
            continue;
        }
        var $sky_dd = $sku_dl.eq(i).find('dd');
        for(var j=0,jj=1; j<$sky_dd.size(); j++){
            if($sky_dd.parents('dl').hasClass('img-dl')){
                var style= $sky_dd.eq(j).find('div').attr('style');
                var img = "<div class='addFile' style='"+style+"'></div>";
                ddVal = img;
                skuInofJsonOfAjax[ii][jj] = ii+"_"+jj+"_img";
            }else{
                ddVal = $sky_dd.eq(j).find('input').val();
                if(ddVal!=null && ddVal!=undefined && ddVal!=""){
                    skuInofJsonOfAjax[ii][jj] = ddVal;
                }
            }
            if(ddVal!=null && ddVal!=undefined && ddVal!=""){
                skuInofJson[ii][jj] = ddVal;
                jj++;
            }
        }
        ii++;
    }
    // JSON.stringify(skuInofJson)
    return skuInofJson;
}

/**
 * 填写表格里的信息
 * @param json 用户填写表单时的所有值 getInputTexts()里可以获得
 */
function fillTable(json) {
    var $tr = $('#productPropertyTable tr');
    var keyMax = 0;
    var valueMax = new Array();

    for(var i in json){
        if(json[i][0] != undefined){
            keyMax++;
            for(var j in json[i]){
                if(json[i][j] != undefined){
                    if(valueMax[i] == undefined){
                        valueMax[i] = 0;
                    }
                    valueMax[i]++;
                }
            }
        }
    }

    switch (valueMax.length){
        case 1:
            for(var i1=1,trNum=1; i1<valueMax[0]; i1++,trNum++){
                fillJsonTable(json[0][i1],'','','',trNum,0);
                // alert(json[0][i1]+"|");
            }
            break;
        case 2:
            for(var i1=1,trNum=1; i1<valueMax[0]; i1++){
                for(var i2=1; i2<valueMax[1]; i2++,trNum++){
                    // alert(json[0][i1]+"|"+json[1][i2]+"|");
                    fillJsonTable(json[0][i1],json[1][i2],'','',trNum,1);
                }
            }
            break;
        case 3:
            for(var i1=1,trNum=1; i1<valueMax[0]; i1++){
                for(var i2=1; i2<valueMax[1]; i2++){
                    for(var i3=1; i3<valueMax[2]; i3++,trNum++){
                        // alert(json[0][i1]+"|"+json[1][i2]+"|"+json[2][i3]+"|");
                        fillJsonTable(json[0][i1],json[1][i2],json[2][i3],'',trNum,2);
                    }
                }
            }
            break;
        case 4:
            for(var i1=1,trNum=1; i1<valueMax[0]; i1++){
                for(var i2=1; i2<valueMax[1]; i2++){
                    for(var i3=1; i3<valueMax[2]; i3++){
                        for(var i4=1; i4<valueMax[3]; i4++,trNum++){
                            // alert(json[0][i1]+"|"+json[1][i2]+"|"+json[2][i3]+"|"+json[3][i4]+"|");
                            fillJsonTable(json[0][i1],json[1][i2],json[2][i3],json[3][i4],trNum,3);
                        }
                    }
                }
            }
            break;
        default:
            break;
    }
    /**
     *
     * @param str1 value值1
     * @param str2 value值2
     * @param str3 value值3
     * @param str4 value值4
     * @param trNum 第n行tr
     * @param keyNum 有多少个key值。从0开始
     */
    function fillJsonTable(str1,str2,str3,str4,trNum,keyNum) {
        if(keyNum == 0){
            $tr.eq(trNum).find('td').eq(0).html(str1);
        }
        if(keyNum == 1){
            $tr.eq(trNum).find('td').eq(0).html(str1);
            $tr.eq(trNum).find('td').eq(1).html(str2);
        }
        if(keyNum == 2){
            $tr.eq(trNum).find('td').eq(0).html(str1);
            $tr.eq(trNum).find('td').eq(1).html(str2);
            $tr.eq(trNum).find('td').eq(2).html(str3);
        }
        if(keyNum == 3){
            $tr.eq(trNum).find('td').eq(0).html(str1);
            $tr.eq(trNum).find('td').eq(1).html(str2);
            $tr.eq(trNum).find('td').eq(2).html(str3);
            $tr.eq(trNum).find('td').eq(3).html(str4);
        }
    }
    $tr.eq(0).find('td').eq(0).html(json[0][0]==undefined?"":json[0][0]);
    $tr.eq(0).find('td').eq(1).html(json[1][0]==undefined?"":json[1][0]);
    $tr.eq(0).find('td').eq(2).html(json[2][0]==undefined?"":json[2][0]);
    $tr.eq(0).find('td').eq(3).html(json[3][0]==undefined?"":json[3][0]);
}

var skuDetailedInof = {};
// SKU保存数据
function SKUfloppyInOf() {
    var tr0Num = 0;
    var tr1Num = 0;
    var tr2Num = 0;
    var tr3Num = 0;
    var trZNum = 3; // 填有数据的有多少列， 0开始
    var skuDetailedInofKey = "";
    for(var value in skuInofJsonOfAjax[0]){
        tr0Num++;
    }
    for(var value in skuInofJsonOfAjax[1]){
        tr1Num++;
    }
    for(var value in skuInofJsonOfAjax[2]){
        tr2Num++;
    }
    for(var value in skuInofJsonOfAjax[3]){
        tr3Num++;
    }

    if(tr0Num == 0){
        tr0Num = tr1Num;
        tr1Num = tr2Num;
        tr2Num = tr3Num;
        --trZNum;
    }
    if(tr1Num == 0){
        tr1Num = tr2Num;
        tr2Num = tr3Num;
        --trZNum;
    }
    if(tr2Num == 0){
        tr2Num = tr3Num;
        --trZNum;
    }
    if(tr3Num == 0){
        --trZNum;
    }

    skuDetailedInof = {};
    switch (trZNum){
        case 0:
            for(var i=0; i<tr0Num; i++){
                skuDetailedInofKey = i+"";
                if($('.productPropertyTable-price').eq(i).val()=="" || $('.productPropertyTable-price').eq(i).val() == undefined){
                    skuDetailedInof["_"+skuDetailedInofKey+"_jg"] = 99999;
                }else{
                    skuDetailedInof["_"+skuDetailedInofKey+"_jg"] = $('.productPropertyTable-price').eq(i).val();
                }
                if($('.productPropertyTable-stock').eq(i).val()=="" || $('.productPropertyTable-stock').eq(i).val() == undefined){
                    skuDetailedInof["_"+skuDetailedInofKey+"_kc"] = 0;
                }else{
                    skuDetailedInof["_"+skuDetailedInofKey+"_kc"] = $('.productPropertyTable-stock').eq(i).val();
                }
            }
            break;
        case 1:
            for(var i=0,ii=0; i<tr0Num; i++){
                for(var j=0; j<tr1Num; j++,ii++){
                    skuDetailedInofKey = i+"_"+j;
                    if($('.productPropertyTable-price').eq(i).val()=="" || $('.productPropertyTable-price').eq(i).val() == undefined){
                        skuDetailedInof["_"+skuDetailedInofKey+"_jg"] = 99999;
                    }else{
                        skuDetailedInof["_"+skuDetailedInofKey+"_jg"] = $('.productPropertyTable-price').eq(i).val();
                    }
                    if($('.productPropertyTable-stock').eq(i).val()=="" || $('.productPropertyTable-stock').eq(i).val() == undefined){
                        skuDetailedInof["_"+skuDetailedInofKey+"_kc"] = 0;
                    }else{
                        skuDetailedInof["_"+skuDetailedInofKey+"_kc"] = $('.productPropertyTable-stock').eq(i).val();
                    }
                }
            }
            break;
        case 2:
            for(var i=0,ii=0; i<tr0Num; i++){
                for(var j=0; j<tr1Num; j++){
                    for(var k=0; k<tr2Num; k++,ii++){
                        skuDetailedInofKey = i+"_"+j+"_"+k;
                        if($('.productPropertyTable-price').eq(i).val()=="" || $('.productPropertyTable-price').eq(i).val() == undefined){
                            skuDetailedInof["_"+skuDetailedInofKey+"_jg"] = 99999;
                        }else{
                            skuDetailedInof["_"+skuDetailedInofKey+"_jg"] = $('.productPropertyTable-price').eq(i).val();
                        }
                        if($('.productPropertyTable-stock').eq(i).val()=="" || $('.productPropertyTable-stock').eq(i).val() == undefined){
                            skuDetailedInof["_"+skuDetailedInofKey+"_kc"] = 0;
                        }else{
                            skuDetailedInof["_"+skuDetailedInofKey+"_kc"] = $('.productPropertyTable-stock').eq(i).val();
                        }
                    }
                }
            }
            break;
        case 3:
            for(var i=0,ii=0; i<tr0Num; i++){
                for(var j=0; j<tr1Num; j++){
                    for(var k=0; k<tr2Num; k++){
                        for(var m=0; m<tr3Num; m++,ii++){
                            skuDetailedInofKey = i+"_"+j+"_"+k+"_"+m;
                            if($('.productPropertyTable-price').eq(i).val()=="" || $('.productPropertyTable-price').eq(i).val() == undefined){
                                skuDetailedInof["_"+skuDetailedInofKey+"_jg"] = 99999;
                            }else{
                                skuDetailedInof["_"+skuDetailedInofKey+"_jg"] = $('.productPropertyTable-price').eq(i).val();
                            }
                            if($('.productPropertyTable-stock').eq(i).val()=="" || $('.productPropertyTable-stock').eq(i).val() == undefined){
                                skuDetailedInof["_"+skuDetailedInofKey+"_kc"] = 0;
                            }else{
                                skuDetailedInof["_"+skuDetailedInofKey+"_kc"] = $('.productPropertyTable-stock').eq(i).val();
                            }
                        }
                    }
                }
            }
            break;
        default:
            break;
    }

    // alert(tr0Num+"<-0|"+tr1Num+"<-1|"+tr2Num+"<-2|"+tr3Num);
}

$(function () {
    // 商品规划
    productProperty();

    $('#shopProductSKU').click(function (event) {
        event.stopPropagation();
        if($(this).attr('shop') == "false"){
            $(this).attr('shop','true');
            $('#productPropertyTable').css('display','block');
            // 生成商品详细表
            addProductInofTable(getProductInofTrCount(), 6);
            $(this).html('隐藏商品详细搭配<i class="fa fa-chevron-up"></i>');
        }else{
            var num = $('#productPropertyTable').find('tbody').find('tr').size();
            for(var i=0; i<num; i++){
                $('#productPropertyTable').find('tbody').find('tr').eq(1).remove();
            }
            $(this).attr('shop','false');
            $('#productPropertyTable').css('display','none');
            $(this).html('显示商品详细搭配<i class="fa fa-chevron-down"></i>');
        }
    });

    $('#sku dl input').keyup(function(event){
        if(event.which == 173){
            $(this).val("");
            alert('非法字符');
        }
        event.stopPropagation();
    });

    // 点击刷新按钮
    $('#SKUrefresh').click(function () {
        if($('#shopProductSKU').attr("shop") == 'true'){
            $('#shopProductSKU').trigger('click');
            $('#shopProductSKU').trigger('click');
        }else{
            $('#shopProductSKU').trigger('click');
        }
    });

    // 点击保存按钮
    $('#SKUfloppy').click(function () {
        SKUfloppyInOf();
    });
});